// © Copyright 2012-2013, 2015-2016 HP Development Company, L.P.

// Task name & description
HSDTaskName = "Proxyserver-indstillinger";
HSDTaskDescription = "Printeren understøtter forbindelsen til Internettet. Hvis du bruger en proxyserver for at komme på nettet, skal du konfigurere nedenstående indstillinger.";
TaskDescriptionInAssistantMode = "Hvis du vil oprette forbindelse til HP Web Services, skal printeren være tilsluttet internettet. Hvis du bruger en proxyserver til at oprette forbindelse til internettet, skal du angive indstillingerne nedenfor.\n\nHvis du ikke kender proxyindstillingerne, kan du se indstillingerne i skærmbilledet med netværksindstillinger, eller du kan kontakte systemadministratoren.";

// Radio buttons matrix
HSDProxyServerNotRequiredTitle = "Der kræves ingen proxyserver til at komme på Internettet";
HSDAutomaticProxySettingsTitle = "Automatisk (enheden registrerer indstillingerne automatisk)";
HSDCustomProxySettingsTitle = "Tilpasset proxy-serverkonfiguration:";
HSDSystemProxySettingsTitle = "Indstillinger for systemkopiering";

// Proxy server settings
HSDProxyServerTitle = "Proxyserver:";
ProxyPortTitle = "Proxy Port:";

// Authentication
HSDRequiresAuthenticationButton = "Proxyserveren kræver autentifikation";
HSDUserNameTitle = "Brugernavn:";
HSDPasswordTitle = "Adgangskode:";

HSDApplyNowButtonTitle = "Anvend nu";

// progress titles
UpdateInformationProcessTitle = "Opdaterer oplysninger...";

// alerts
EmptyProxyServerOrPortErrorText = "Både proxyserver og proxyport skal angives.";

EmptyUserNameOrPasswordErrorText = "Proxyserver-autentifikation kræver, at der oplyses både et brugernavn og en adgangskode.";

IncorrectProxyServerNameFormatErrorText = "Kunne ikke indstille proxyserverens navn. Kontrollér, at formatet er gyldigt.";

HSDUserNameTooLargeErrorText = "Brugernavnet er for langt. Din enhed understøtter maksimalt %d tegn i brugernavnet.";
